In [2]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.read_excel("comb1.xlsx")
df2 = pd.read_excel("comb2.xlsx")

In [4]:
df1.head()

     Name   Id Department  Salary
0     Raj  101   Computer   45000
1    Titu  102         ai   30000
2  Manshi  103         ml   35000
3    Yash  104         ai   45000
4   Zaker  105         ai   50000

In [5]:
df2.head()

    Id Department  Salary Product_sale  No_Of_Product
0  101   Computer   45000        Parts              2
1  102         ai   30000     Software              3
2  103         ml   35000     Software              2
3  104         ai   45000     Software              5
4  105         ai   50000        Parts              5

In [6]:
#Compinig Data Frame
comb_df1 = pd.concat([df1, df2])
comb_df1

       Name   Id Department  Salary Product_sale  No_Of_Product
0       Raj  101   Computer   45000          NaN            NaN
1      Titu  102         ai   30000          NaN            NaN
2    Manshi  103         ml   35000          NaN            NaN
3      Yash  104         ai   45000          NaN            NaN
4     Zaker  105         ai   50000          NaN            NaN
5     Santa  106         ml   65000          NaN            NaN
6  Catwomen  107   Computer   25000          NaN            NaN
0       NaN  101   Computer   45000        Parts            2.0
1       NaN  102         ai   30000     Software            3.0
2       NaN  103         ml   35000     Software            2.0
3       NaN  104         ai   45000     Software            5.0
4       NaN  105         ai   50000        Parts            5.0
5       NaN  106         ml   65000        Parts            4.0
6       NaN  107   Computer   25000        Parts            5.0

In [7]:
comb_df2 = pd.concat([df1, df2], axis = 1)
comb_df2

,Name,Id,Department,Salary,Id,Department,Salary,Product_sale,No_Of_Product
0,Raj,101,Computer,45000,101,Computer,45000,Parts,2
1,Titu,102,ai,30000,102,ai,30000,Software,3
2,Manshi,103,ml,35000,103,ml,35000,Software,2
3,Yash,104,ai,45000,104,ai,45000,Software,5
4,Zaker,105,ai,50000,105,ai,50000,Parts,5
5,Santa,106,ml,65000,106,ml,65000,Parts,4
6,Catwomen,107,Computer,25000,107,Computer,25000,Parts,5

In [9]:
#Marge Data Frame
pd.merge(df1, df2, on = 'Id')

,Name,Id,Department_x,Salary_x,Department_y,Salary_y,Product_sale,No_Of_Product
0,Raj,101,Computer,45000,Computer,45000,Parts,2
1,Titu,102,ai,30000,ai,30000,Software,3
2,Manshi,103,ml,35000,ml,35000,Software,2
3,Yash,104,ai,45000,ai,45000,Software,5
4,Zaker,105,ai,50000,ai,50000,Parts,5
5,Santa,106,ml,65000,ml,65000,Parts,4
6,Catwomen,107,Computer,25000,Computer,25000,Parts,5

In [12]:
# df3 = df2.append(Id)  it was remove in last pandas update